function [x, flag, relres, iter, resvec, errvec] = pcg_my1084516(A, b, tol, maxit, M1, M2, x0, xsol, varargin)
    % Υποκείμενη συνάρτηση pcg_myid
    
    % Οι παράμετροι varargin μπορείτε να τις προσαρμόσετε σύμφωνα με τις ανάγκες σας.

    % Αρχικοποίηση των διανυσμάτων
    x = x0; % Αρχική εκτίμηση λύσης
    r = b - A * x; % Υπολογισμός αρχικού υπολοίπου
    z = preconditioner_my1084516(r, A); % Υπολογισμός του προϋπολογιστή M1
    p = z; % Αρχικοποίηση κατεύθυνσης

    % Αρχικοποίηση των λοιπών μεταβλητών
    iter = 0; % Αρχικός αριθμός επαναλήψεων
    relres = norm(r) / norm(b); % Αρχική σχετική ακρίβεια
    resvec = relres; % Αποθήκευση σχετικής ακρίβειας σε διάνυσμα
    errvec = norm(xsol - x, 'fro'); % Αρχικό σφάλμα

    % Κύριος βρόγχος της μεθόδου PCG
    while relres > tol && iter < maxit
        q = A * p; % Πολλαπλασιασμός A με την κατεύθυνση p
        alpha = (r' * z) / (p' * q); % Υπολογισμός βήματος
        x = x + alpha * p; % Ενημέρωση λύσης
        r = r - alpha * q; % Ενημέρωση υπολοίπου
        z = preconditioner_my1084516(r, A); % Υπολογισμός του προϋπολογιστή M1
        beta = (r' * z) / (p' * z); % Υπολογισμός παράγοντα βήματος
        p = z + beta * p; % Ενημέρωση κατεύθυνσης

        % Υπολογισμός νέων τιμών
        iter = iter + 1; % Αύξηση αριθμού επαναλήψεων
        relres = norm(full(r), 'fro') / norm(full(b), 'fro'); % Υπολογισμός νέας σχετικής ακρίβειας
        resvec(iter+1, 1) = relres; % Αποθήκευση νέας σχετικής ακρίβειας σε διάνυσμα
        errvec(iter+1, 1) = norm(full(xsol - x), 'fro'); % Υπολογισμός νέου σφάλματος
    end

    % Καθορισμός του flag
    if relres <= tol
        flag = 0; % Επιτυχής σύγκλιση
    elseif iter >= maxit
        flag = 1; % Μέγιστος αριθμός επαναλήψεων
    else
        flag = 2; % Άγνωστος λόγος αποτυχίας
    end
end
