function [x, error_norm, numerical_cost] = solve_tridiagonal_system_1084516(A, B ,D ,L ,U)
    % Λύση του τριδιαγωνικού συστήματος Ax = B

    inv_D = inv(D);       % Αντίστροφος του D

    % Ιδιότητες :
    disp('Ιδιότητες του πίνακα:');
    disp('D είναι διαγώνιος πίνακας:');
    disp(D);

    % Υπολογισμός LD^(-1)U, UD^(-1)L
    LD_invU = L * inv_D * U;
    UD_invL = U * inv_D * L;

    disp('LD^(-1)U είναι διαγώνιος πίνακας:');
    disp(LD_invU);

    disp('UD^(-1)L είναι διαγώνιος πίνακας:');
    disp(UD_invL);

    % Ο όρος LD−1L είναι μητρώο με μοναδικά μη μηδενικά στοιχεία στη 2η υποδιαγώνιο
    disp('LD^(-1)L είναι μητρώο με μοναδικά μη μηδενικά στοιχεία στη 2η υποδιαγώνιο:');
    LD_invL = L * inv_D * L;
    disp(LD_invL);

    % Ο όρος UD−1U είναι μητρώο με μοναδικά μη μηδενικά στοιχεία στη 2η υπερδιαγώνιο
    disp('UD^(-1)U είναι μητρώο με μοναδικά μη μηδενικά στοιχεία στη 2η υπερδιαγώνιο:');
    UD_invU = U * inv_D * U;
    disp(UD_invU);

    M = (D + L + U) * inv_D * (D - L - U);

    % Λύση του συστήματος M * x = b_prime
    x = M \ ((D + L + U) * inv_D * B);

    % Υπολογισμός της άμεσης λύσης για σύγκριση
    x_direct = A \ B;

    % Υπολογισμός της 2-νόρμας του σφάλματος
    error_norm = norm(x - x_direct);

    % Αριθμητικό κόστος ως συνάρτηση του n
    numerical_cost = nnz(M);
end
